Repository: Huevos/EITConfig
Catalog: po/*.po
Languages: fi

source: Add a service
fi: Lisää kanava

source: Add service
fi: Lisää kanava

source: Added service %s
fi: Lisättiin kanava %s

source: EIT Setup Actions
fi: EIT:n asetukset

source: Edit Now/Next EIT Blacklist
fi: Muokkaa Nyt/Seuraava EIT:n mustaa listaa

source: Edit Now/Next EIT Whitelist
fi: Muokkaa Nyt/Seuraava EIT:n valkoista listaa

source: Eit Setup Actions
fi: EIT:n asetustoiminnot

source: It is only possible to add services that exist in lamedb.
fi: On mahdollista lisätä vain lamedb:ssä olevia kanavia.

source: No
fi: Ei

source: No, and don't ask again
fi: Ei, äläkä kysy uudelleen

source: Now/Next Blacklist
fi: Nyt/Seuraava mustalista

source: Now/Next Whitelist
fi: Nyt/Seuraava valkolista

source: Remove
fi: Poista

source: Remove a service
fi: Poista kanava

source: Removed service %s
fi: Poistettu kanava %s

source: Select
fi: Valitse

source: Would you like to add all services from provider '%s'?
fi: Haluatko lisätä kaikki palveluntarjoajan '%s' kanavat?

source: Would you like to remove all services from provider '%s'?
fi: Haluatko poistaa kaikki palveluntarjoajan '%s' kanavat?

source: Yes
fi: Kyllä

source: cable
fi: kaapeli

source: terrestrial
fi: antenni

source: Read help info
fi: Lue ohjetiedot

source: Help Screen
fi: Ohje-näyttö

source: First a quick explanation of EPG data. EPG data can come from 4 sources:
fi: Ensin lyhyt selitys EPG-tiedoista. EPG-tiedot voivat tulla 4 lähteestä:

source: - Now/Next, downloaded from the current transport stream, displayed on the infobar, not written to EPG cache, and discarded on channel change.
fi: - Nyt/Seuraava, ladattu nykyisestä siirtovirrasta, näytetään tietopalkissa, ei kirjoitettu EPG-välimuistiin ja hylätään kanavan vaihdon yhteydessä.

source: - EIT, downloaded from the current transport stream, displayed in the various simple and graphical EPG screens, contains title, description, genre, and age recomendation. Typically contains entries for up to seven days in advance, is saved to epgcache and for that reason it persists on channel change.
fi: - Nykyisestä siirtovirrasta ladattu EIT, joka näkyy erilaisissa yksinkertaisissa ja graafisissa EPG-näytöissä, sisältää otsikon, kuvauksen, tyylilajin ja ikäsuosituksen. Sisältää tyypillisesti merkinnät jopa seitsemän päivää etukäteen, tallennetaan EPG-välimuistiin ja siksi se säilyy kanavan vaihdon yhteydessä.

source: - OpenTV (or similar), downloaded every now and again from different a transport stream, the data is similar to EIT, it is saved to EPG cache and persists on channel change.
fi: - OpenTV (tai vastaava), ladattu silloin tällöin eri siirtovirrasta, tiedot ovat EIT:n kaltaisia, ne tallennetaan EPG-välimuistiin ja säilyvät kanavan vaihdon yhteydessä.

source: - Online import, downloaded from the internet, typically once a day, the data is similar to EIT, it is saved to EPG cache and persists on channel change.
fi: - Online-tuonti, ladattu Internetistä, tyypillisesti kerran päivässä, tiedot ovat EIT:n kaltaisia, ne tallennetaan EPG-välimuistiin ja säilyvät kanavan vaihdon yhteydessä.

source: As the EPG data is available from multiple sources it is possible to have conflicting data. This conflicting data leads to 'overlaps' or corruption in the epg screens, e.g. one source says the program spans 13:00-14:00 and another source says 13:05-14:05, and with different titles or descriptions.
fi: Koska EPG-tiedot ovat saatavilla useista lähteistä, on mahdollista saada ristiriitaisia tietoja. Nämä ristiriitaiset tiedot johtavat 'päällekkäisyyksiin' tai korruptoitumiseen EPG-näytöissä, esim. yksi lähde kertoo, että ohjelma on kello 13.00-14.00 ja toinen lähde kertoo 13:05-14:05 ja eri otsikoilla tai kuvauksilla.

source: To avoid this corruption we can add individual channels (or complete providers) to a 'whitelist' or 'blacklist'.
fi: Tämän korruptoitumisen välttämiseksi voimme lisätä yksittäisiä kanavia (tai kokonaisia palveluntarjoajia) 'valkoiselle listalle' tai 'mustalle listalle'.

source: Purpose of 'whitelist'. Sometimes real time data from Now/Next is preferable to the online imported data which may be stale. Adding a channel to the 'whitelist' allows Now/Next data for that channel to be saved in the epgcache, rather than just being discarded on channel change, and the Now/Next data will overwrite the online imported data.
fi: 'Valkoisen listan' tarkoitus. Joskus reaaliaikaiset Nyt/Seuraava-tiedot ovat parempia kuin verkosta tuodut tiedot, jotka voivat olla vanhentuneita. Kanavan lisääminen 'valkoiselle listalle' sallii tämän kanavan Nyt/Seuraava-tietojen tallentamisen EPG-välimuistiin, sen sijaan, että ne hylättäisiin kanavan vaihdon yhteydessä ja Nyt/Seuraava-tiedot korvaavat verkosta tuodut tiedot.

source: Purpose of 'blacklist'. In contrast to the above, sometimes the data provided on the transport stream, either EIT or Now/Next is not reliable and we prefer just the data from the online import. In these cases the channel in question can be added to the 'blacklist' and then no data from the current transport stream will enter the EPG cache and the online imported data will persist.
fi: 'Mustan listan' tarkoitus. Toisin kuin edellä, toisinaan kuljetusvirrassa joko EIT tai Nyt/Seuraava-tiedot eivät ole luotettavia ja suosimme vain verkosta tuotuja tietoja. Näissä tapauksissa kyseinen kanava voidaan lisätä 'mustalle listalle', jolloin nykyisen siirtovirran tiedot eivät pääse EPG-välimuistiin ja verkosta tuodut tiedot säilyvät.
